In [1]:
import pandas as pd

In [3]:
items ={'Bob': pd.Series([245, 25, 55], ['bike', 'pants', 'watch']),
        'Alice': pd.Series([40, 110, 500, 45], ['book', 'glasses', 'bike', 'pants'])} 

items

{'Bob': bike     245
 pants     25
 watch     55
 dtype: int64, 'Alice': book        40
 glasses    110
 bike       500
 pants       45
 dtype: int64}

In [4]:
print(type(items))

<class 'dict'>

In [5]:
shopping_carts = pd.DataFrame(items)
shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [7]:
data ={'Bob': pd.Series([245, 25, 55]),
        'Alice': pd.Series([40, 110, 500, 45])} 
df = pd.DataFrame(data)
df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

In [9]:
shopping_carts.items

<bound method DataFrame.iteritems of            Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN>

In [10]:
shopping_carts.index

Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

In [11]:
shopping_carts.columns

Index(['Bob', 'Alice'], dtype='object')

In [12]:
shopping_carts.values

array([[245., 500.],
       [ nan,  40.],
       [ nan, 110.],
       [ 25.,  45.],
       [ 55.,  nan]])

In [13]:
shopping_carts.shape

(5, 2)

In [14]:
shopping_carts.ndim

2

In [15]:
shopping_carts.size

10

In [16]:
bob_shopping_cart = pd.DataFrame(items, columns=['Bob'])
bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

In [17]:
filtered_shopping_cart = pd.DataFrame(items, index=['bike', 'pants'])
filtered_shopping_cart

       Bob  Alice
bike   245    500
pants   25     45

In [19]:
alice_shopping_cart = pd.DataFrame(items, columns=['Alice'], index=['glasses', 'book'])
alice_shopping_cart

         Alice
glasses    110
book        40

In [20]:
data = { 'Integers': [1, 2, 3],
         'Floats': [4.5, 8.2, 9.6] }
df = pd.DataFrame(data)
df

   Integers  Floats
0         1     4.5
1         2     8.2
2         3     9.6

In [21]:
data = { 'Integers': [1, 2, 3],
         'Floats': [4.5, 8.2, 9.6] }
df = pd.DataFrame(data, index=['Value 1', 'Value 2', 'Value 3'])
df

         Integers  Floats
Value 1         1     4.5
Value 2         2     8.2
Value 3         3     9.6

In [22]:
items = [{'bikes': 20, 'pants': 30, 'watches': 35}, {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants': 5}]

store_items = pd.DataFrame(items)
store_items

   bikes  glasses  pants  watches
0     20      NaN     30       35
1     15     50.0      5       10

In [23]:
items = [{'bikes': 20, 'pants': 30, 'watches': 35}, {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants': 5}]

store_items = pd.DataFrame(items, index=['store 1', 'store 2'])
store_items

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

In [24]:
store_items[['bikes']]

         bikes
store 1     20
store 2     15

In [25]:
store_items[['bikes', 'watches']]

         bikes  watches
store 1     20       35
store 2     15       10

In [27]:
store_items.loc[['store 1']]

         bikes  glasses  pants  watches
store 1     20      NaN     30       35

In [28]:
store_items['bikes']['store 2']

15

In [29]:
store_items['shirts'] = [15, 2]
store_items

         bikes  glasses  pants  watches  shirts
store 1     20      NaN     30       35      15
store 2     15     50.0      5       10       2

In [30]:
store_items['suits'] = store_items['shirts'] + store_items['pants']
store_items

         bikes  glasses  pants  watches  shirts  suits
store 1     20      NaN     30       35      15     45
store 2     15     50.0      5       10       2      7

In [32]:
new_items = [{'bike2': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]

new_store = pd.DataFrame(new_items, index=['store 3'])
new_store

         bike2  glasses  pants  watches
store 3     20        4     30       35

### if you don't set sort in the append method, a warning will appear letting you know that a future version of pandas will no longet sort by default, setting it to False will mean you accept the future changes, setting it to True will mean that you want the current default functionality

In [40]:
store_items = store_items.append(new_store, sort=True)
store_items

         bike2  bikes  glasses  pants  shirts  suits  watches
store 1    NaN   20.0      NaN     30    15.0   45.0       35
store 2    NaN   15.0     50.0      5     2.0    7.0       10
store 3   20.0    NaN      4.0     30     NaN    NaN       35

In [39]:
store_items = store_items.drop([store_items.index[2]])
store_items

         bike2  bikes  glasses  pants  shirts  suits  watches
store 1    NaN   20.0      NaN     30    15.0   45.0       35
store 2    NaN   15.0     50.0      5     2.0    7.0       10

In [41]:
store_items['new_watches'] = store_items['watches'][1:]
store_items

         bike2  bikes  glasses  pants  shirts  suits  watches  new_watches
store 1    NaN   20.0      NaN     30    15.0   45.0       35          NaN
store 2    NaN   15.0     50.0      5     2.0    7.0       10         10.0
store 3   20.0    NaN      4.0     30     NaN    NaN       35         35.0

In [42]:
store_items.insert(5, 'shoes', [5, 15, 7])
store_items

,bike2,bikes,glasses,pants,shirts,shoes,suits,watches,new_watches
store 1,NaN,20.0,NaN,30,15.0,5,45.0,35,NaN
store 2,NaN,15.0,50.0,5,2.0,15,7.0,10,10.0
store 3,20.0,NaN,4.0,30,NaN,7,NaN,35,35.0

In [43]:
store_items.pop('new_watches')
store_items

         bike2  bikes  glasses  pants  shirts  shoes  suits  watches
store 1    NaN   20.0      NaN     30    15.0      5   45.0       35
store 2    NaN   15.0     50.0      5     2.0     15    7.0       10
store 3   20.0    NaN      4.0     30     NaN      7    NaN       35

In [44]:
store_items = store_items.drop(['watches', 'shoes'], axis = 1)
store_items

         bike2  bikes  glasses  pants  shirts  suits
store 1    NaN   20.0      NaN     30    15.0   45.0
store 2    NaN   15.0     50.0      5     2.0    7.0
store 3   20.0    NaN      4.0     30     NaN    NaN

In [46]:
store_items = store_items.drop(['store 1', 'store 2'], axis = 0)
store_items

         bike2  bikes  glasses  pants  shirts  suits
store 3   20.0    NaN      4.0     30     NaN    NaN

In [50]:
store_items = store_items.rename(columns={'bike2': 'hats'})
store_items

         hats  glasses  pants  shirts  suits
store 3  20.0      4.0     30     NaN    NaN

In [51]:
store_items = store_items.rename(index={'store 3': 'last store'})
store_items

            hats  glasses  pants  shirts  suits
last store  20.0      4.0     30     NaN    NaN

In [52]:
store_items = store_items.set_index('pants')
store_items

       hats  glasses  shirts  suits
pants
30     20.0      4.0     NaN    NaN